package com.serzh.my.classes_objects_interfaces

//Модификатор Соответствующий член            Комментарии
//final       He может быть переопределен     Применяется к членам класса по умолчанию
//open        Может быть переопределен        Должен указываться явно
//abstract    Должен быть переопределен       Используется только в абстрактных классах; абстрактные методы не могут иметь реализацию
//override    Переопределяет метод супе       По умолчанию переопределяющий метод открыт, если только не объявлен как final
//            или интерфейса


//Модификатор             Член класса                 Объявление верхнего уровня
//public (по умолчанию)   Доступен повсюду            Доступно повсюду
//internal                Доступен только в модуле    Доступно в модуле
//protected               Доступен в подклассах       -
//private                 Доступен в классе           Доступно в файле